app/controllers/joblistings_controller.rb

	def index
		joblistings = Joblisting.all
---
SELECT "joblistings".* FROM "joblistings"

	def create
		joblisting = Joblisting.new(job_listing_params)
		if joblisting.save
---
INSERT INTO "joblistings" ("name", "start_date", "end_date", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "newnewnew"], ["start_date", "2020-04-28"], ["end_date", "2020-04-28"], ["description", "dd"], ["created_at", "2020-04-28 05:16:39.900185"], ["updated_at", "2020-04-28 05:16:39.900185"]]

	def update
		joblisting = Joblisting.find(params[:id])
		if joblisting.update(job_listing_params)
---
SELECT "joblistings".* FROM "joblistings" WHERE "joblistings"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "joblistings" SET "name" = ?, "start_date" = ?, "end_date" = ?, "updated_at" = ? WHERE "joblistings"."id" = ?  [["name", "test"], ["start_date", "2020-04-28"], ["end_date", "2020-04-28"], ["updated_at", "2020-04-28 05:33:46.108643"], ["id", 2]]

	def destroy
		joblisting = Joblisting.find(params[:id])
		unless joblisting.nil?
			joblisting.destroy
---
SELECT "joblistings".* FROM "joblistings" WHERE "joblistings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "joblistings" WHERE "joblistings"."id" = ?  [["id", 1]]