app/controllers/users_controller.rb

	def create
		user = User.new(user_params)
		if user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "dude"], ["email", "dude@gmail.com"], ["password_digest", "pass"], ["created_at", "2020-04-28 04:01:46.244501"], ["updated_at", "2020-04-28 04:01:46.244501"]]

	def destroy
		user = User.find(params[:id])
		unless user.nil?
			user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 19]]